App/DataProcessors/АРМДиспетчера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АРМДиспетчера</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

App/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданКурьеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Enums/СтатусыКурьеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКурьеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНаСмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеВремяДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическоеВремяДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоДоставки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

App/DataProcessors/АРМДиспетчера/Forms/ФормаАРМ/Ext/Form/Module.bsl
// Форма АРМ диспетчера.
// Зона 1 - динамический список активных заказов, зона 2 - список курьеров.
// Назначение курьера выполняется без открытия карточки заказа.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заказы.Параметры.УстановитьЗначениеПараметра("СтатусыАктивные", МассивАктивныхСтатусов());
	ПрименитьФильтрыНаСервере();
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаСервере
Функция МассивАктивныхСтатусов()

	Результат = Новый Массив;
	Результат.Добавить(Перечисления.СтатусыЗаказов.Новый);
	Результат.Добавить(Перечисления.СтатусыЗаказов.Готовится);
	Результат.Добавить(Перечисления.СтатусыЗаказов.ПереданКурьеру);
	Возврат Результат;

КонецФункции

// Фильтры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)

	ПрименитьФильтрыНаСервере();
	Элементы.ТаблицаЗаказов.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СброситьФильтры(Команда)

	СброситьФильтрыНаСервере();
	Элементы.ТаблицаЗаказов.Обновить();
	Элементы.ТаблицаКурьеров.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)

	Элементы.ТаблицаЗаказов.Обновить();
	Элементы.ТаблицаКурьеров.Обновить();

КонецПроцедуры

&НаСервере
Процедура СброситьФильтрыНаСервере()

	ФильтрРесторан = Справочники.Рестораны.ПустаяСсылка();
	ФильтрСтатус = Перечисления.СтатусыЗаказов.ПустаяСсылка();
	ФильтрКурьер = Справочники.Курьеры.ПустаяСсылка();
	ПрименитьФильтрыНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПрименитьФильтрыНаСервере()

	Заказы.Параметры.УстановитьЗначениеПараметра("ИспользоватьРесторан", ЗначениеЗаполнено(ФильтрРесторан));
	Заказы.Параметры.УстановитьЗначениеПараметра("Ресторан", ФильтрРесторан);
	Заказы.Параметры.УстановитьЗначениеПараметра("ИспользоватьСтатус", ЗначениеЗаполнено(ФильтрСтатус));
	Заказы.Параметры.УстановитьЗначениеПараметра("Статус", ФильтрСтатус);
	Заказы.Параметры.УстановитьЗначениеПараметра("ИспользоватьКурьера", ЗначениеЗаполнено(ФильтрКурьер));
	Заказы.Параметры.УстановитьЗначениеПараметра("Курьер", ФильтрКурьер);

КонецПроцедуры

// Назначение курьера

&НаКлиенте
Процедура НазначитьКурьера(Команда)

	ДанныеЗаказа = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	ДанныеКурьера = Элементы.ТаблицаКурьеров.ТекущиеДанные;

	Если ДанныеЗаказа = Неопределено Тогда
		Сообщить("Выберите заказ в списке активных заказов.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	Если ДанныеКурьера = Неопределено Тогда
		Сообщить("Выберите курьера в списке курьеров.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	ТекстОшибки = НазначитьКурьераНаЗаказ(ДанныеЗаказа.Ссылка, ДанныеКурьера.Ссылка);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
	Иначе
		Сообщить("Курьер """ + Строка(ДанныеКурьера.Наименование) + """ назначен на заказ "
			+ Строка(ДанныеЗаказа.Номер) + ".", СтатусСообщения.Информация);
	КонецЕсли;

	Элементы.ТаблицаЗаказов.Обновить();
	Элементы.ТаблицаКурьеров.Обновить();

КонецПроцедуры

// Двойной щелчок по заказу не открывает карточку: работа ведется в одном окне.
&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

// Возвращает пустую строку, если курьер назначен; иначе текст причины отказа.
&НаСервере
Функция НазначитьКурьераНаЗаказ(ЗаказСсылка, КурьерСсылка)

	Если КурьерСсылка.ТекущийСтатус = Перечисления.СтатусыКурьеров.НеНаСмене Тогда
		Возврат "Курьер не на смене. Назначение невозможно.";
	КонецЕсли;

	Попытка
		НачатьТранзакцию();

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.Заказ");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗаказСсылка);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();

		ОбъектЗаказа = ЗаказСсылка.ПолучитьОбъект();

		Если ОбъектЗаказа.Статус = Перечисления.СтатусыЗаказов.Доставлен
			ИЛИ ОбъектЗаказа.Статус = Перечисления.СтатусыЗаказов.Отменен Тогда
			ОтменитьТранзакцию();
			Возврат "Заказ уже завершен и не может быть передан курьеру.";
		КонецЕсли;

		ОбъектЗаказа.Курьер = КурьерСсылка;
		Если ОбъектЗаказа.Статус = Перечисления.СтатусыЗаказов.Новый
			ИЛИ ОбъектЗаказа.Статус = Перечисления.СтатусыЗаказов.Готовится Тогда
			ОбъектЗаказа.Статус = Перечисления.СтатусыЗаказов.ПереданКурьеру;
		КонецЕсли;

		Если НЕ ОбъектЗаказа.Записать() Тогда
			ОтменитьТранзакцию();
			Возврат "Заказ не записан: проверьте состав заказа и курьера.";
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		Возврат "";

	Исключение
		ОтменитьТранзакцию();
		Возврат "Не удалось назначить курьера: " + ОписаниеОшибки();
	КонецПопытки;

КонецФункции

// Условное оформление

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ДобавитьОформлениеПоЗначению("Статус", Перечисления.СтатусыЗаказов.Новый, Новый Цвет(221, 240, 255), "Новый");
	ДобавитьОформлениеПоЗначению("Статус", Перечисления.СтатусыЗаказов.Готовится, Новый Цвет(255, 246, 200), "Готовится");
	ДобавитьОформлениеПоЗначению("Статус", Перечисления.СтатусыЗаказов.ПереданКурьеру, Новый Цвет(230, 230, 230), "Передан курьеру");
	ДобавитьОформлениеПоЗначению("ТекущийСтатус", Перечисления.СтатусыКурьеров.Свободен, Новый Цвет(214, 240, 214), "Свободен");
	ДобавитьОформлениеПоЗначению("ТекущийСтатус", Перечисления.СтатусыКурьеров.Занят, Новый Цвет(255, 224, 196), "Занят");
	ДобавитьОформлениеПоЗначению("ТекущийСтатус", Перечисления.СтатусыКурьеров.НеНаСмене, Новый Цвет(240, 240, 240), "Не на смене");

КонецПроцедуры

&НаСервере
Процедура ДобавитьОформлениеПоЗначению(ИмяПоля, Значение, Цвет, Представление)

	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = Представление;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);

	ЭлементОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры
